# Ex2-3.1 อ่านสตริงจาก input เก็บใน x สตริงที่อ่านมามีรูปแบบ h:m:s แทน ชั่วโมง:นาที:วินาที
# เช่น 10:30:00 หรือ 8:30:15
# ให้สร้างตัวแปร 3 ตัว h, m และ s ที่เก็บจำนวนเต็มของชั่วโมง นาที และวินาที่ตามลำดับ

x = input().split(", ")
s = int(x[0])
s += int(x[1])
s += int(x[2])
s += int(x[3])
print(s/4)


# Ex2-3.2 อ่านสตริงจาก input ที่มีรูปแบบ  รหัสนักศึกษา: คะแนน, คะแนน, คะแนน
# เช่น 10232: 20, 30.5, 15.8
# เก็บสตริงรหัสนักศึกษาใน student_id
# เก็บคำนวนคะแนนเฉลี่ยใน average_point

t = input().split(": ")
student_id = t[0]
x = t[1].split(", ")
s = float(x[0])
s += float(x[1])
s += float(x[2])
average_point = s/3