#เขียนโปรแกรมตามผังงานข้าง ๆ นี้ (ลองทำความเข้าใจด้วยว่าทำอะไร ?)
#โจทย์อยู่ใน README.md Assignment 4-5.1
t = input()
s = 0
for c in t:
    if "0" <= c <= "9":
        s += 1
print(s)

#โจทย์อยู่ใน README.md Assignment 4-5.2
t = input()
s = ""
for c in t:
    if c in ".,()":
        s += " "
    else:
        s += c
print(s)

#Ex4-5.3
#อ่านสตริงจาก input หนึ่งบรรทัด จากนั้นแสดงเฉพาะตัวอักษรอังกฤษในสตริงที่อ่านมาจากซ้ายไปขวา บรรทัดละตัว 
#เช่น อ่านมาเป็น "A-B-123 &" จะแสดงแค่ A กับ B (บรรทัดละตัว)
t = input()
s = ""
for c in t:
    if "a" <= c <= "z" or "A" <= c <= "Z":
        print(c)
print(s)

#Ex4-5.4
#อ่านสตริงจาก input หนึ่งบรรทัด จากนั้นแสดงเฉพาะตัวอักขระในสตริงที่อยู่ที่ index คี่ (ตัวซ้ายสุดคือ index 0) บรรทัดละตัว 
#เช่น อ่านมาเป็น "*ABCDE*" จะแสดงแค่ A, C กับ E (บรรทัดละตัว)
t = input()
s = ""
for c in t[1::2]:
        print(c)
print(s)


#Ex4-5.5
#อ่านสตริงหนึ่งบรรทัดจาก input แล้วแสดงตัวอักษรในสตริงที่อ่านมาจากขวามาซ้าย บรรทัดละตัว
t = input()
for c in t[::-1]:
    print(c)