#Ex4-6.1
#กำหนดให้มีรายการรหัสสินค้าจาก input (คั่นด้วยช่องว่าง) 
#เช่น A1023 P223 A392 จงเขียนโปรแกรมอ่านรหัสสินค้าจาก input นำรหัสสินค้าจากซ้ายไปขวามาแสดงบรรทัดละหนึ่งรหัส
prod_ids = input().split()
for pid in prod_ids:
    print(pid)

#Ex4-6.2
#กำหนดให้มีรายการรหัสสินค้าจาก input (เริ่มด้วยประเภทสินค้าตามด้วย : ตามด้วยรหัสสินค้าคั่นด้วยช่องว่าง) เช่น Office Product: A1023 P223 A392 
#จงเขียนโปรแกรมอ่านรหัสสินค้าจาก input นำเฉพาะรหัสสินค้าจากขวามาซ้ายไปแสดงบรรทัดละหนึ่งรหัส
x = input().split(":")
prod_ids = x[1].split()
for pid in prod_ids[::-1]:
    print(pid)

#Ex4-6.3
#อ่านสตริงตามด้วยการ split ให้เป็นลิสต์เก็บใน x จากนั้นอ่านสตริงอีกตัวเก็บใน a 
#จงเขียนคำสั่งเพื่อนับและแสดงว่า มีค่าใน a ที่เก็บอยู่ในลิสต์ x กี่ตัว
x = input().split()
a = input()
c = 0
for e in x:
    if e == a:
        c += 1
print(c)