#Ex4-2.1
#ให้เขียนโปรแกรมรับจำนวนเต็ม n จาก input เพื่อแสดงจำนวนเต็มคี่ตั้งแต่ 1 ถึงจำนวนคี่ที่ไม่เกิน n (โดยใช้วงวน while)
n = int(input())
i = 1
while i <= n:
  print(i)
  i += 2

#Ex4-2.2
#ข้อมูลที่ input มีบรรทัดแรกเป็นจำนวนเต็ม n ตามด้วยอีก n บรรทัดเป็นจำนวนเต็ม d0, d1, ..., dn-1 บรรทัดละจำนวน 
#จงเขียนโปรแกรมอ่านข้อมูลจาก input (โดยใช้วงวน while) เพื่อหาผลรวมของ d0, d1, ..., dn-1
n = int(input())
k = 0
s = 0
while k < n:
    s += int(input())
    k += 1
print(s)

#Ex4-2.3
#ข้อมูลจาก input เป็นจำนวนเต็ม บรรทัดละจำนวน 
#จงเขียนโปรแกรมรับข้อมูลจาก input (โดยใช้วงวน while) เพื่อหาผลรวมของจำนวนที่อ่านเข้ามา จนพบจำนวนลบ (ไม่รวมจำนวนลบ)
s = 0
x = int(input())
while x >= 0:
    s += x
    x = int(input())
print(s)


#Ex4-2.3
#ข้อมูลจาก input เป็นจำนวนเต็ม บรรทัดละจำนวน จนถึงบรรทัดสุดท้ายจะเป็นคำว่า end 
#จงเขียนโปรแกรมรับข้อมูลจาก input (โดยใช้วงวน while) เพื่อหาผลรวมของจำนวนที่อ่านเข้ามา จนพบคำว่า end
s = 0
x = input()
while x != "end":
    s += int(x)
    x = input()
print(s)

