#Ex8-2.1
#จงสร้างตัวแปรชื่อ count_alpha เป็นดิกที่มี key เป็นตัวอักษรอังกฤษทั้งใหญ่และเล็กทุกตัวอักษร ส่วน value ให้เป็น 0 หมด
count_alpha = {}
alpha = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
alpha += alpha.lower()
for c in alpha:
    count_alpha[c] = 0

#Ex8-2.2
#มีดิกชื่อ number_of_students อยู่แล้วตัวหนึ่ง จัดเก็บข้อมูลในรูปแบบ {รหัสวิชา: จำนวนนิสิตที่ลงทะเบียน} โดยรหัสวิชาเป็นสตริง 
#จงเขียนคำสั่งเพิ่มจำนวนนิสิตที่ลงทะเบียนให้กับวิชา 2110101 อีก 28 คน และตั้งให้วิชา 2301107 มีนิสิตลงทะเบียน 824 คน
number_of_students["2110101"] += 28
number_of_students["2301107"] = 824

#Ex8-2.3
#โปรแกรมนี้มีตัวแปร student1 เป็นดิกเก็บรายละเอียดของนักเรียนคนหนึ่ง จงเขียนฟังก์ชัน read_data() มีหน้าที่อ่านข้อมูลจากอินพุตประกอบด้วย เลขประจำตัว, ชื่อ-สกุล, วัน, เดือน, ปีเกิด (คั่นด้วย comma และช่องว่าง) มาเก็บในดิกที่มีรูปแบบเดียวกับ student1 แล้วคืนเป็นผลของฟังก์ชัน เช่น อินพุตเป็น 4230000021, Natalie P., 9, 6, 1981 จ
#ะได้ผลจาก read_data เป็น {"ID": "4230000021", "Name": "Natalie P.", "Birthdate": [9, 6, 1981]}
#def read_data():
    #x = input().split(", ")


#student1 = {"ID": "5830000021", 
            #"Name": "Pranpriya M.", 
            #"Birthdate": [27, 3, 1997]}

def read_data():
    x = input().split(", ")
    r = {}
    r["ID"] = x[0]
    r["Name"] = x[1]
    r["Birthdate"] = [int(x[2]), int(x[3]), int(x[4])]
    return r

#Ex8-2.4
#จงเขียนโปรแกรมอ่านจากอินพุตบรรทัดเดียวเป็นรายการของชื่อย่อจังหวัด อังกฤษกับไทย คั่นด้วยช่องว่าง เช่น BKK กทม CMI ชม 
#เพื่อนำมาสร้างเป็นดิกชื่อ abbr = {"BKK": "กทม", "CMI": "ชม", "กทม": "BKK" ,"ชม": "CMI"}
x = input().split()
abbr = {}
for i in range(0,len(x),2):
    abbr[x[i]] = x[i+1]
    abbr[x[i+1]] = x[i]