#Ex5-2.1
#อ่านจำนวนเต็มจาก input เก็บใน n จากนั้นสร้างลิสต์ a ให้มีค่าเป็น [1**2, 2**2, 3**2, ..., n**2]
n = int(input())
a = []
for i in range(1,n+1):
    a.append(i**2)

#Ex5-2.2
#มี a เป็นลิสต์เก็บสตริงให้แล้ว จงสร้างลิสต์ b มีขนาดเท่าลิสต์ a โดย b[i] เก็บค่าสตริงกลับลำดับของ a[i] 
#เช่น a = ["python", "java"] จะได้ b = ["nohtyp", "avaj"]
b = []
for i in range(len(a)):
    b.append(a[i][::-1])

#Ex5-2.3
#โปรแกรมข้างล่างนี้อ่านข้อมูลการจัดการลิสต์ x เก็บในตัวแปร c โดยมีลักษณะการทำงาน 4 แบบขึ้นกับค่าของ c ดังรูป 
#จงเติมที่เขียน ??? ให้สมบูรณ์ (หมายเหตุ: สำหรับการลบ ข้อมูลที่ให้ลบมีอยู่ใน x แน่ ๆ ไม่ต้องกังวลว่าจะหาไม่พบ)
#A d คือนำ d ไปต่อท้ายลิสต์ x
#I j d คือแทรก d ที่ index j ใน x
#R data คือลบ d หนึ่งตัวออกจาก x
#P j คือลบตัวที่ index j ออกจาก x
x = ['a', 'bb', 'ccc', 'd', 'e']
c = input().split()
if c[0] == "A":
    x.append(c[1])
elif c[0] == "I":
    x.insert(int(c[1]), c[2])
elif c[0] == "R":
    x.remove(c[1])
elif c[0] == "P":
    x.pop(int(c[1]))
print(x)

#Ex5-2.4
#ข้อนี้เหมือนข้อที่แล้ว 
#แต่มีสิ่งต้องตรวจสอบเพิ่มเติมคือ 
#ข้อมูลที่ต้องการลบอาจไม่มีอยู่ในลิสต์, index ที่ต้องการลบหรือเพิ่มข้อมูลอาจไม่ใช่ index ที่ถูกต้อง 
#ในกรณีที่พบเหตุการณ์เช่นนี้ในแสดงข้อความว่า Invalid
#A d คือนำ d ไปต่อท้ายลิสต์ x
#I j d คือแทรก d ที่ index j ใน x
#R data คือลบ d หนึ่งตัวออกจาก x
#P j คือลบตัวที่ index j ออกจาก x
x = ['a', 'bb', 'ccc', 'd', 'e']
c = input().split()
invalid = False
if c[0] == "A":
    x.append(c[1])
elif c[0] == "I":
    idx = int(c[1])
    if -(len(x)+1) <= idx <= len(x):
        x.insert(idx, c[2])
    else:
        invalid = True
elif c[0] == "R":
    if c[1] in x:
        x.remove(c[1])
    else:
        invalid = True
elif c[0] == "P":
    idx = int(c[1])
    if -len(x) <= idx < len(x):
        x.pop(idx)
    else:
        invalid = True
if not invalid: 
    print(x)
else:
    print("Invalid")

#Ex5-2.5
#มีข้อมูลทาง input สามบรรทัด 
#บรรทัดแรกเป็นรายการของรหัสสินค้า 
#บรรทัดที่สองเป็นรายการของราคา (มีจำนวนข้อมูลเท่ากับของบรรทัดแรก โดยสินค้าชิ้นที่ตำแหน่ง i ก็มีราคาที่ตำแหน่ง i) 
#บรรทัดสุดท้ายเป็นรหัสสินค้าที่อยากรู้ว่าราคาเท่าไร ถ้าเป็นรหัสที่ไม่มีอยู่ ให้แสดง Not found (หมายเหตุ: หัดใช้เมท็อดของลิสต์ที่เพิ่งเรียนมา)
# บรรทัดแรก A100 A200 A300 A400
# บรรทัดที่สอง 20.5 50.0 35.0 65.0
# บรรทัดที่สาม A300
prod_ids = input().split()
prices = input().split()
qid = input()
if qid in prod_ids:
    i = prod_ids.index(qid)
    print(prices[i])
else:
    print("Not found")

#Ex5.2-6
#โปรแกรมข้างล่างนี้มีลิสต์ d เก็บจำนวนเต็ม มีคำสั่งอ่านจำนวนเต็มเก็บใน q 
#จงเขียนคำสั่งต่อเพื่อหาว่า q เป็นตัวที่น้อยสุดอันดับที่เท่าไรใน d (กำหนดให้ตัวที่น้อยสุด ๆ ใน d คือตัวน้อยสุดอันดับ 1) ถ้าใน d ไม่มี q ให้แสดง Not found
d = [98,2,7,54,38,21,0,8,22,45,62]
q = int(input())
if q not in d:
    print("Not found")
else:
    d.sort()
    k = d.index(q)
    print(k+1)
