#Ex5-3.1
#อ่านข้อมูลจาก input ที่มีลักษณะดังตัวอย่างในรูป 
#input= 5,10.2,23.1,20.2 ,19.1 ,19.2
#บรรทัดแรกบอกจำนวนข้อมูลและตามด้วยข้อมูลบรรทัดละจำนวน จากตัวอย่าง 
#จงเขียนคำสั่งอ่านเข้ามาเก็บในลิสต์ชื่อ x มีค่าคือ [10.2, 23.1, 20.2, 19.1, 19.2]
#กำหนดให้ input
n = int(input())
x = []
for i in range(n):
    e = float(input())
    x.append(e)

#Ex5-3.2
#อ่านข้อมูลจาก input ที่มีลักษณะดังตัวอย่างในรูป 
#input= 5,10.2,23.1,20.2 ,19.1 ,19.2
#บรรทัดแรกบอกจำนวนข้อมูลและตามด้วยข้อมูลบรรทัดละจำนวน จากตัวอย่าง 
#จงเขียนคำสั่งอ่านเข้ามาเก็บในลิสต์ชื่อ x มีค่าคือ [19.2, 19.1, 20.2, 23.1, 10.2]
n = int(input())
x = []
for i in range(n):
    e = float(input())
    x.insert(0,e)

#Ex5-3.3
#อ่านข้อมูลจาก input ที่มีลักษณะดังตัวอย่างในรูป 
#input=10.2,23.1,20.2,19.1,19.2
#คือ มีข้อมูลบรรทัดละจำนวน โดยบรรทัดสุดท้ายเป็นคำว่า end จากตัวอย่าง 
#จงเขียนคำสั่งอ่านเข้ามาเก็บในลิสต์ชื่อ x มีค่าคือ [10.2, 23.1, 20.2, 19.1, 19.2]
x = []
e = input()
while e != "end":
    x.append(float(e))
    e = input()

#Ex5-3.4
#อ่านข้อมูลจาก input ที่มีลักษณะดังตัวอย่างในรูป
#input=10.2,23.1,20.2,19.1,19.2
#อ่านข้อมูลจาก input ที่มีลักษณะดังตัวอย่างในรูป คือ มีข้อมูลบรรทัดละจำนวน โดยบรรทัดสุดท้ายเป็นคำว่า end จากตัวอย่าง 
#จงเขียนคำสั่งอ่านเข้ามาเก็บในลิสต์ชื่อ x ให้มีค่าเป็น [10.2, 20.2, 19.2, 23.1, 19.1] คือให้นำข้อมูลตำแหน่งคู่ของอินพุตมานำหน้าข้อมูลตำแหน่งคี่
 
x = []
e = input()
while e != "end":
    x.append(float(e))
    e = input()
x = x[::2] + x[1::2]

#Ex5-3.5
#อ่านข้อมูลจาก input ที่มีลักษณะเป็นจำนวนเต็มเรียงกันในบรรทัดเดียว คั่นด้วยช่องว่าง เช่น 20 10 30 10 
#จงเขียนคำสั่งอ่านเข้ามาเก็บในลิสต์ของจำนวนเต็มชื่อ x เช่นจากตัวอย่างจะได้ x = [20, 10, 30, 10]
x = []
d = input().split()
for e in d:
    x.append(int(e))

#Ex5-3.6
#อ่านข้อมูลจาก input ที่มีลักษณะเป็นรายการของรหัสภาคฯ กับชื่อภาคฯ ในบรรทัดเดียวกัน 
#คั่นด้วยช่องว่าง เช่น CE Civil ME Mechanical EE Electrical 
#จงเขียนคำสั่งอ่านอินพุตมาสร้างเป็นสองลิสต์ คือ dept_codes กับ dept_names เช่น จากตัวอย่าง จะได้ dept_codes = ["CE", "ME", "EE"] และ 
#dept_names = ["Civil", "Mechanical", "Electrical"]
x = input().split()
dept_codes = x[::2]
dept_names = x[1::2]

