#Ex5-4.1
#กำหนดให้มีตัวแปร x เป็นลิสต์เก็บจำนวนเต็มมาให้แล้ว 
#จงสร้างลิสต์ y ที่เก็บค่ากำลังสองของแต่ละตัวใน x ในลำดับเดียวกับ x และแสดงค่าของ y ด้วย
x = input ()
y = []
for e in x:
    y.append(e**2)
print(y)

#Ex5-4.2
#กำหนดให้มีตัวแปร x เป็นลิสต์เก็บจำนวนเต็มมาให้แล้ว 
#จงสร้างลิสต์ y ที่มีแต่ค่าที่ใน x ที่เป็นจำนวนบวกในลำดับเดียวกับ x และแสดงค่าของ y ด้วย
x = input ()
y = []
for e in x:
    if e > 0:
        y.append(e)
print(y)


#Ex5-4.3
#กำหนดให้มีตัวแปร x เป็นลิสต์เก็บจำนวนเต็มมาให้แล้ว 
#จงสร้างลิสต์ y ที่เก็บค่ารากที่สองของแต่ละตัวใน x (เลือกทำกับค่าใน x ที่เป็นจำนวนไม่ติดลบเท่านั้น) 
#ในลำดับเดียวกับ x และแสดงค่าของ y ด้วย
x = input ()
y = []
for e in x:
    if e >= 0:
        y.append(e**0.5)
print(y)