#Ex5-5.1 
#กำหนดให้มีตัวแปร x เป็นลิสต์เก็บจำนวนเต็มมาให้แล้ว 
#จงนับว่าใน x มีข้อมูลคู่ที่ติดกันเหมือนกันอยู่กี่คู่ เช่น x = [1,1,1,1,2,2] มีติดกันหมือนกันอยู่ 4 คู่
x = input ()
c = 0
for i in range(len(x)-1):
    if x[i] == x[i+1]:
        c += 1
print(c)

#Ex5-5.2
#กำหนดให้มีตัวแปร x เป็นลิสต์เก็บจำนวนเต็มมาให้แล้ว 
#จงตรวจว่า ข้อมูลใน x จากซ้ายไปขวา เรียงค่าจากน้อยไปมากหรือไม่ ถ้าใช่แสดง YES, ไม่ใช่ แสดง NO
x = input ()
for i in range(len(x)-1):
    if x[i] > x[i+1]:
        break
if len(x) > 1 and x[i] > x[i+1]:
    print("NO")
else:
    print("YES")