#Ex5-8.1
#เขียนคำสั่งอ่านชื่อย่อธนาคารจากอินพุต แต่ละชื่อคั่นด้วยช่องว่าง (อาจมีมากกว่าหนึ่งช่อง) เช่น SCB BBL KBANK 
#เพื่อจัดรูปแบบและแสดงให้ชื่อคั่นด้วย comma และช่องว่างหนึ่งช่อง เช่น SCB, BBL, KBANK
t = input().split()
print(", ".join(t))

#Ex5-8.2
#เขียนคำสั่งอ่านรายการของจำนวนเต็มจากอินพุต แต่ละจำนวนคั่นด้วยช่องว่าง มาเพิ่มค่าจำนวนละอีก 1 
#แล้วเก็บผลลัพธ์เป็นสตริงในตัวแปรชื่อ output เช่น รับ 10 20 30 จะได้ output เป็น "11 21 31"
x = input().split()
y = []
for e in x:
    y.append(str(int(e)+1))
output = " ".join(y)

#Ex5-8.3
#โปรแกรมที่ข้างล่างนี้ รับจำนวนเต็มจากอินพุต แล้วแสดงตัวประกอบทั้งหมด โดยแสดงบรรทัดละตัว (ลอง run ดู โดยระบบจะป้อนอินพุตให้อัตโนมัติด้วยค่า 8568) 
#จงเปลี่ยนโปรแกรมนี้ให้ตัวประกอบในบรรทัดเดียวกันโดยมีตัว x คั่น เช่น เมื่ออินพุตเป็น 8568 จะแสดง 2x2x2x3x3x7x17
#n = int(input())  # กด run จะได้ค่า n เป็น 8568
#k = 2
#while k <= n:
    #if n%k == 0:
        #print(k)
        #n //= k
    #else:
        #k += 1
        
n = int(input())
k = 2
f = []
while k <= n:
    if n%k == 0:
        f.append(str(k))
        n //= k
    else:
        k += 1
print("x".join(f))