# Ex1-5.1
# รับสตริงจาก input เก็บในตัวแปร grade
# แสดงข้อความว่า I'll get ตามด้วยช่องว่าง 1 ช่อง
# ตามด้วยค่าในตัวแปร grad

grade = input()
print("I'll get", grade)

# Ex1-5.2
# รับจำนวนจริงจาก input เก็บในตัวแปร h
# รับจำนวนจริงจาก input เก็บในตัวแปร w
# h คือความสูงของสามเหลี่ยม
# w คือความยาวฐานของสามเหลี่ยม
# แสดงพื้นที่ของสามเหลี่ยม

h = float(input())
w = float(input())
print(h*w/2)


# Ex1-5.3
# รับจำนวนเต็มจาก input เก็บในตัวแปร x
# รับจำนวนเต็มจาก input เก็บในตัวแปร y
# คำนวณ x ยกกำลัง y เก็บใน z
# นำหลักหน่วยของ z เก็บใน d
# แสดงค่าของ d

x = int(input())
y = int(input())
z = x**y
d = z%10
print (d)